In [3]:
import pandas as pd

In [6]:
df = pd.read_csv('tips.csv')

In [7]:
df.head()

   rownames  total_bill   tip     sex smoker  day    time  size
0         1       16.99  1.01  Female     No  Sun  Dinner     2
1         2       10.34  1.66    Male     No  Sun  Dinner     3
2         3       21.01  3.50    Male     No  Sun  Dinner     3
3         4       23.68  3.31    Male     No  Sun  Dinner     2
4         5       24.59  3.61  Female     No  Sun  Dinner     4

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rownames    244 non-null    int64
 1   total_bill  244 non-null    float64
 2   tip         244 non-null    float64
 3   sex         244 non-null    object
 4   smoker      244 non-null    object
 5   day         244 non-null    object
 6   time        244 non-null    object
 7   size        244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB

In [9]:
df.describe()

         rownames  total_bill         tip        size
count  244.000000  244.000000  244.000000  244.000000
mean   122.500000   19.785943    2.998279    2.569672
std     70.580923    8.902412    1.383638    0.951100
min      1.000000    3.070000    1.000000    1.000000
25%     61.750000   13.347500    2.000000    2.000000
50%    122.500000   17.795000    2.900000    2.000000
75%    183.250000   24.127500    3.562500    3.000000
max    244.000000   50.810000   10.000000    6.000000

In [10]:
df.isnull().sum()

rownames      0
total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [ ]:
# grouping variable smoker and total_bill berdasarkan mean nya -> melihat rata-rata total_bill berdasarkan status perokok atau tidak
df.groupby('smoker')['total_bill'].mean()

smoker
No     19.188278
Yes    20.756344
Name: total_bill, dtype: float64

In [ ]:
# melihat banyak baris dan kolom nya
df.shape

(244, 8)

In [21]:
# melihat rata-rata total_bill yang di dapatkan pada bulan ini (misalnya)
df['total_bill'].mean()

np.float64(19.78594262295082)

In [24]:
# melihat kapan waktu makan yang banyak pengunjungnya
df['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [25]:
# melihat hari apa yang paling banyak pengunjungnya
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [ ]:
# melihat hubungan antr variable -> value nya itu antara -1 sampai 1
df[['total_bill', 'tip']].corr()

            total_bill       tip
total_bill    1.000000  0.675734
tip           0.675734  1.000000

In [31]:
# buat kolom atau variable baru yang menyimpan persentase tip
df['tip_pct'] = (df['tip'] / df['total_bill']) * 100

In [32]:
df.head()

   rownames  total_bill   tip     sex smoker  day    time  size    tip_pct
0         1       16.99  1.01  Female     No  Sun  Dinner     2   5.944673
1         2       10.34  1.66    Male     No  Sun  Dinner     3  16.054159
2         3       21.01  3.50    Male     No  Sun  Dinner     3  16.658734
3         4       23.68  3.31    Male     No  Sun  Dinner     2  13.978041
4         5       24.59  3.61  Female     No  Sun  Dinner     4  14.680765

In [33]:
# grouping variable sex dengan variable tip_pct
df.groupby('sex')['tip_pct'].mean()

sex
Female    16.649074
Male      15.765055
Name: tip_pct, dtype: float64